Revit 2027 API
FabricationPart.Reposition Method
 Repositions the fabrication straight part to another end of the run.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void Reposition(
	Document document,
	ElementId partId
)
Public Shared Sub Reposition (
	document As Document,
	partId As ElementId
)
public:
static void Reposition(
	Document^ document,
	ElementId^ partId
)
static member Reposition :
        document : Document *
        partId : ElementId -> unit
Parameters
document Document
 The document.
partId ElementId
 Identifier of the fabrication part to reposition.
Exceptions
Exception | Condition
ArgumentException |  It is not a straight segment on the end in the run. -or- There are locked parts in the run.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace